<a href="https://colab.research.google.com/github/skyworld19/ds-school-advanced/blob/master/bicycle_LAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##데이타 다운

In [ ]:
!wget -N --http-user=mysuni --http-passwd=mysuni1! http://sk.jaen.kr:8080/datasets/seoul_bicycle.csv

--2021-07-26 08:44:38--  http://sk.jaen.kr:8080/datasets/seoul_bicycle.csv
Resolving sk.jaen.kr (sk.jaen.kr)... 49.247.134.238
Connecting to sk.jaen.kr (sk.jaen.kr)|49.247.134.238|:8080... connected.
HTTP request sent, awaiting response... 401 Unauthorized
Authentication selected: Basic realm="Authentication required."
Reusing existing connection to sk.jaen.kr:8080.
HTTP request sent, awaiting response... 200 OK
Length: 31147551 (30M) [text/csv]
Saving to: ‘seoul_bicycle.csv’

seoul_bicycle.csv   100%[===================>]  29.70M  9.91MB/s    in 3.0s

2021-07-26 08:44:41 (9.91 MB/s) - ‘seoul_bicycle.csv’ saved [31147551/31147551]

### 데이타 로드

In [ ]:
import sklearn.model_selection as model_selection
import pandas as pd
bicycle = pd.read_csv('seoul_bicycle.csv', na_values='\\N')
bicycle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    327231 non-null  object
 1   대여소번호   327231 non-null  int64
 2   대여소명    327231 non-null  object
 3   대여구분코드  327231 non-null  object
 4   성별      158123 non-null  object
 5   연령대코드   327231 non-null  object
 6   이용건수    327231 non-null  int64
 7   운동량     326830 non-null  float64
 8   탄소량     326830 non-null  float64
 9   이동거리    327231 non-null  float64
 10  이용시간    327231 non-null  int64
dtypes: float64(3), int64(3), object(5)
memory usage: 27.5+ MB

In [ ]:
# 데이터의 내용 확인을 위해 앞의 데이터 5개 출력

          대여일자  대여소번호      대여소명  대여구분코드  ...      운동량    탄소량      이동거리  이용시간
0  Jan-20-2020      3      중랑센터  일일(회원)  ...    61.82   0.52    2230.0    75
1  Jan-20-2020      3      중랑센터  일일(회원)  ...    39.62   0.28    1220.0    15
2  Jan-20-2020      3      중랑센터      정기  ...   430.85   4.01   17270.0    53
3  Jan-20-2020      5  상암센터 정비실  일일(회원)  ...     1.79   0.02      90.0    33
4  Jan-20-2020      5  상암센터 정비실      정기  ...  4501.96  45.47  196010.0    64

[5 rows x 11 columns]

In [ ]:
# 통계치 확인

               대여소번호           이용건수  ...          이동거리           이용시간
count  327231.000000  327231.000000  ...  3.272310e+05  327231.000000
mean     1288.411064      23.615400  ...  1.068811e+05     752.814486
std      1012.645329      59.922618  ...  4.634955e+05    2647.383179
min         3.000000       1.000000  ...  0.000000e+00       0.000000
25%       562.000000       2.000000  ...  5.290000e+03      66.000000
50%      1204.000000       6.000000  ...  2.290000e+04     207.000000
75%      1933.000000      22.000000  ...  9.346000e+04     670.000000
max     99999.000000    7451.000000  ...  5.670905e+07  458960.000000

[8 rows x 6 columns]

In [ ]:
# 대여일자는 복합적인 데이터가 포함되어 있음 : 날짜형
# 대여소명, 대여구분코드, 성별, 연령대코드 : 범주형
-> dtype을 변경 (날짜형은 datetime, 범주형은 ML 모델링 전에 LabelEncoding 또는 One-hot-encoding)

# 성별, 운동량, 탄소량 : NaN값 존재
-> 삭제, 다른 값으로 채울지 등의 전략 준비

# 이용건수
Target 데이터 -> 이용건수 알아내기

## 데이타 정제

### 날짜 데이타 변환

In [ ]:
# 'rentDate'에 대해서 datetime 타입으로 변경



bicycle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 12 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   대여일자      327231 non-null  object
 1   대여소번호     327231 non-null  int64
 2   대여소명      327231 non-null  object
 3   대여구분코드    327231 non-null  object
 4   성별        158123 non-null  object
 5   연령대코드     327231 non-null  object
 6   이용건수      327231 non-null  int64
 7   운동량       326830 non-null  float64
 8   탄소량       326830 non-null  float64
 9   이동거리      327231 non-null  float64
 10  이용시간      327231 non-null  int64
 11  rentDate  327231 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(3), object(5)
memory usage: 30.0+ MB

### 날짜 데이타 분리

In [ ]:
# 연도(year), 월(month), 일(day), 요일(dayofweek), 분기(quarter),
# 시(hour), 분(minute), 초(second) 컬럼 생성
# 생성된 컬럼에 datetime 컬럼으로부터 정보를 추출하여 대입
rentDate = bicycle['rentDate'].dt





bicycle.head()

          대여일자  대여소번호  대여소명  대여구분코드  ... quarter hour  minute  second
0  Jan-20-2020      3  중랑센터  일일(회원)  ...       1    0       0       0
1  Jan-20-2020      3  중랑센터  일일(회원)  ...       1    0       0       0
2  Jan-20-2020      3  중랑센터      정기  ...       1    0       0       0

[3 rows x 20 columns]

In [ ]:
# dayofweek에 대해서 범주형 데이터 분석 (value_counts 사용)

0    127049
2     77621
4     68488
3     54073
Name: dayofweek, dtype: int64

In [ ]:
# 주말(1), 평일(0)  # dayofweek가 0~4는 평일, 5,6 주말
# 주말인지 평일인지 표시하는 column 추가해 보셔도 좋습니다.  (수요일에 이야기 드려볼께요.)

In [ ]:
# year에 대해서 범주형 데이터 분석 (value_counts 사용)

2020    327231
Name: year, dtype: int64

In [ ]:
# month에 대한 분석 - value_counts

5    77621
4    73604
3    68488
2    54073
1    53445
Name: month, dtype: int64

In [ ]:
# day에 대한 분석 - value_counts

20    327231
Name: day, dtype: int64

In [ ]:
# quarter에 대한 분석 - value_counts

1    176006
2    151225
Name: quarter, dtype: int64

In [ ]:
# second에 대한 분석 - value_counts

0    327231
Name: second, dtype: int64

In [ ]:
# 범주형에대해서 돗수분포 확인 (value_counts)
# 대여소, 대여구분코드, 성별, 연령대코드 : 범주형

In [ ]:
bicycle.columns.values

array(['대여일자', '대여소번호', '대여소명', '대여구분코드', '성별', '연령대코드', '이용건수', '운동량',
       '탄소량', '이동거리', '이용시간', 'rentDate', 'year', 'month', 'day',
       'dayofweek', 'quarter', 'hour', 'minute', 'second'], dtype=object)

In [ ]:
# 대여소에 대한 value_counts()
#

207. 여의나루역 1번출구 앞      363
502. 뚝섬유원지역 1번출구 앞     357
152. 마포구민체육센터 앞        351
3511. 응봉역 1번출구         339
565. 옥수역 3번출구          336
                      ...
3133.핀란드 타워앞             1
1774.반석교회(쌍문동)           1
1754. 창동시장입구 사거리         1
773.염창역 3, 4번 출구 사이      1
2542.신논현타워 앞             1
Name: 대여소명, Length: 2015, dtype: int64

In [ ]:
# 대여소번호 에 대한 value_counts()
#

207     363
502     357
152     351
3511    339
565     336
       ...
1743      1
3430      1
1755      1
3004      1
3561      1
Name: 대여소번호, Length: 2015, dtype: int64

In [ ]:
# 연령대코드 에 대한 value_counts()

AGE_002    69517
AGE_003    59917
AGE_004    55682
AGE_001    44348
AGE_005    43013
AGE_006    24293
AGE_008    20698
AGE_007     9763
Name: 연령대코드, dtype: int64

In [ ]:
# 대여구분코드 에 대한 value_counts()

정기         172260
일일(회원)     119408
단체          25710
일일(비회원)      9206
BIL_021       246
Name: 대여구분코드, dtype: int64

In [ ]:
# 성별에 대한 unique()

array(['M', nan, 'F', 'm', 'f'], dtype=object)

In [ ]:
# 성별에 대한 value_counts()

M    84006
F    73932
m      115
f       70
Name: 성별, dtype: int64

In [ ]:
# 'm' -> 'M', 'f' ->'F'로 대체하기 (indexing 사용)

In [ ]:
# 'm' -> 'M', 'f' ->'F'로 대체하기 (replace 사용)

In [ ]:
bicycle['성별'].value_counts()   # 'm' -> 'M', 'f' ->'F'

M    84121
F    74002
Name: 성별, dtype: int64

###Nan값 처리

In [ ]:
bicycle.isna().sum()

대여일자              0
대여소번호             0
대여소명              0
대여구분코드            0
성별           169108
연령대코드             0
이용건수              0
운동량             401
탄소량             401
이동거리              0
이용시간              0
rentDate          0
year              0
month             0
day               0
dayofweek         0
quarter           0
hour              0
minute            0
second            0
dtype: int64

In [ ]:
# 성별 -> 남, 여, 없음 (M, F, N)
# NA값을 'N'으로 채우기

In [ ]:
운동량, 탄소량 => 401   # 같은지

In [ ]:
# 운동량이 NA 인 것에 대해서 운동량, 탄소량에 대해 isna 개수를 세어 본다
# 두 개가 동일한 행에서 NA인지에 대해 확인해 보는 것

bicycle.loc[bicycle['운동량'].isna(), ['운동량', '탄소량']].isna().sum()

운동량    401
탄소량    401
dtype: int64

In [ ]:
400/327000

0.0012232415902140672

In [ ]:
bicycle.isna().sum()

대여일자           0
대여소번호          0
대여소명           0
대여구분코드         0
성별             0
연령대코드          0
이용건수           0
운동량          401
탄소량          401
이동거리           0
이용시간           0
rentDate       0
year           0
month          0
day            0
dayofweek      0
quarter        0
hour           0
minute         0
second         0
dtype: int64

In [ ]:
# NA에 대해서 삭제


# 삭제 된 것 확인
bicycle.isna().sum()

대여일자         0
대여소번호        0
대여소명         0
대여구분코드       0
성별           0
연령대코드        0
이용건수         0
운동량          0
탄소량          0
이동거리         0
이용시간         0
rentDate     0
year         0
month        0
day          0
dayofweek    0
quarter      0
hour         0
minute       0
second       0
dtype: int64


### 사용할 column 선택

In [ ]:
bicycle.columns

Index(['대여일자', '대여소번호', '대여소명', '대여구분코드', '성별', '연령대코드', '이용건수', '운동량', '탄소량',
       '이동거리', '이용시간', 'rentDate', 'year', 'month', 'day', 'dayofweek',
       'quarter', 'hour', 'minute', 'second'],
      dtype='object')

In [ ]:
data = bicycle[['month', 'dayofweek', 'quarter', '연령대코드','운동량', '탄소량','대여소번호','대여구분코드', '이용건수']]
data.head()

   month  dayofweek  quarter    연령대코드      운동량    탄소량  대여소번호  대여구분코드  이용건수
0      1          0        1  AGE_003    61.82   0.52      3  일일(회원)     3
1      1          0        1  AGE_004    39.62   0.28      3  일일(회원)     1
2      1          0        1  AGE_005   430.85   4.01      3      정기     3
3      1          0        1  AGE_005     1.79   0.02      5  일일(회원)     2
4      1          0        1  AGE_003  4501.96  45.47      5      정기     1

##상관계수

In [ ]:
data.corr()

              month  dayofweek   quarter  ...       탄소량     대여소번호      이용건수
month      1.000000   0.035358  0.866974  ...  0.053634  0.015485  0.115624
dayofweek  0.035358   1.000000 -0.455966  ...  0.007961  0.002302 -0.018777
quarter    0.866974  -0.455966  1.000000  ...  0.040709  0.012464  0.109122
운동량        0.003745   0.000727  0.002674  ...  0.019162  0.003092  0.013337
탄소량        0.053634   0.007961  0.040709  ...  1.000000 -0.012315  0.634818
대여소번호      0.015485   0.002302  0.012464  ... -0.012315  1.000000 -0.029476
이용건수       0.115624  -0.018777  0.109122  ...  0.634818 -0.029476  1.000000

[7 rows x 7 columns]

In [ ]:
data2 = pd.get_dummies(data)
data2.head()

   month  dayofweek  quarter  ...  대여구분코드_일일(비회원)  대여구분코드_일일(회원)  대여구분코드_정기
0      1          0        1  ...               0              1          0
1      1          0        1  ...               0              1          0
2      1          0        1  ...               0              0          1
3      1          0        1  ...               0              1          0
4      1          0        1  ...               0              0          1

[5 rows x 20 columns]

##Scale

In [ ]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler

##데이타분할

In [ ]:
from sklearn.model_selection import train_test_split

##선형회귀

In [ ]:
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import SGDRegressor
import numpy as np

다항회귀

In [ ]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import PolynomialFeatures
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import SGDRegressor
import numpy as np

#표준화
# scaled = StandardScaler().fit_transform(df)
scaled = MinMaxScaler().fit_transform(df)
df_scaled = pd.DataFrame(scaled, columns = df.columns.values)
df_scaled.head()

X_data = df_scaled.drop('이용건수', axis=1)
y_data = df_scaled['이용건수']

train score:0.9299441247627936, test score:0.9242976173099504
mean squared error :4.70408588379348e-06
root mean squared error :0.002168890472982322
mean absolute error :0.0009273134469020215

### GridSearchCV를 활용한 과대 적합 확인

In [ ]:
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import Ridge, Lasso

229404    0.007651
315612    0.000940
40568     0.001208
285631    0.001611
239538    0.006711
            ...
135588    0.000940
45021     0.000000
231165    0.000134
275656    0.000268
306756    0.006980
Name: 이용건수, Length: 98170, dtype: float64